arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_fcfg1.h
// Field:  [15:8] PVH
//
// Program verify hold time in half-microseconds after SAFELV goes low. Value
// will be converted to number of FCLK cycles by the flash device driver and
// the converted value is written to FLASH:FSM_PE_VH.PGM_VH when an
// erase/program operation is initiated.
#define FCFG1_FLASH_P_R_PV_PVH_M                                    0x0000FF00
#define FCFG1_FLASH_P_R_PV_PVH_S                                             8

// Field:   [7:0] PVH2
//
// Program verify row switch time in half-microseconds.
#define FCFG1_FLASH_P_R_PV_PVH2_M                                   0x000000FF
#define FCFG1_FLASH_P_R_PV_PVH2_S                                            0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_EH_SEQ
//
//*****************************************************************************
// Field: [31:24] EH
//
// Erase hold time in half-microseconds after SAFELV goes low. Value will be
// converted to number of FCLK cycles by the flash device driver and the
// converted value is written to FLASH:FSM_ERA_OH.ERA_OH when an erase/program
// operation is initiated.
#define FCFG1_FLASH_EH_SEQ_EH_M                                     0xFF000000
#define FCFG1_FLASH_EH_SEQ_EH_S                                             24

// Field: [23:16] SEQ
//
// Pump sequence control.
#define FCFG1_FLASH_EH_SEQ_SEQ_M                                    0x00FF0000
#define FCFG1_FLASH_EH_SEQ_SEQ_S                                            16

// Field: [15:12] VSTAT
//
// Max number of HCLK cycles allowed for pump brown-out. Value will be written
// to FLASH:FSM_VSTAT.VSTAT_CNT when an erase/program operation is initiated.
#define FCFG1_FLASH_EH_SEQ_VSTAT_M                                  0x0000F000
#define FCFG1_FLASH_EH_SEQ_VSTAT_S                                          12

// Field:  [11:0] SM_FREQUENCY
//
// Max FCLK frequency allowed for program, erase, and verify reads.
#define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_M                           0x00000FFF
#define FCFG1_FLASH_EH_SEQ_SM_FREQUENCY_S                                    0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_VHV_E
//
//*****************************************************************************
// Field: [31:16] VHV_E_START
//
// Starting VHV-Erase CT for stairstep erase. Value will be written to
// FLASH:FSM_PRG_PUL.BEG_EC_LEVEL when an erase/program operation is initiated.
#define FCFG1_FLASH_VHV_E_VHV_E_START_M                             0xFFFF0000
#define FCFG1_FLASH_VHV_E_VHV_E_START_S                                     16

// Field:  [15:0] VHV_E_STEP_HIGHT
//
// Number of VHV CTs to step after each erase pulse (up to the max). The actual
// FMC register value should be one less than this since the FMC starts
// counting from zero. Value will be written to
// FLASH:FSM_EC_STEP_HEIGHT.EC_STEP_HEIGHT when an erase/program operation is
// initiated.
#define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_M                        0x0000FFFF
#define FCFG1_FLASH_VHV_E_VHV_E_STEP_HIGHT_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_PP
//
//*****************************************************************************
// Field: [31:24] PUMP_SU
//
// Pump read-&#62;non-read mode transition time in half-microseconds (mainly
// for FPES).
#define FCFG1_FLASH_PP_PUMP_SU_M                                    0xFF000000
#define FCFG1_FLASH_PP_PUMP_SU_S                                            24

// Field:  [15:0] MAX_PP
//
// Max program pulse limit per program operation. Value will be written to
// FLASH:FSM_PRG_PUL.MAX_PRG_PUL when an erase/program operation is initiated.
#define FCFG1_FLASH_PP_MAX_PP_M                                     0x0000FFFF
#define FCFG1_FLASH_PP_MAX_PP_S                                              0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_PROG_EP
//
//*****************************************************************************
// Field: [31:16] MAX_EP
//
// Max erase pulse limit per erase operation. Value will be written to
// FLASH:FSM_ERA_PUL.MAX_ERA_PUL when an erase/program operation is initiated.
#define FCFG1_FLASH_PROG_EP_MAX_EP_M                                0xFFFF0000
#define FCFG1_FLASH_PROG_EP_MAX_EP_S                                        16

// Field:  [15:0] PROGRAM_PW
//
// Program pulse width in half-microseconds. Value will be converted to number
// of FCLK cycles by the flash device driver and the converted value is written
// to FLASH:FSM_PRG_PW.PROG_PUL_WIDTH when a erase/program operation is
// initiated.
#define FCFG1_FLASH_PROG_EP_PROGRAM_PW_M                            0x0000FFFF
#define FCFG1_FLASH_PROG_EP_PROGRAM_PW_S                                     0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_ERA_PW
//
//*****************************************************************************
// Field:  [31:0] ERASE_PW
//
// Erase pulse width in half-microseconds. Value will be converted to number of
// FCLK cycles by the flash device driver and the converted value is written to
// FLASH:FSM_ERA_PW.FSM_ERA_PW when a erase/program operation is initiated.
#define FCFG1_FLASH_ERA_PW_ERASE_PW_M                               0xFFFFFFFF
#define FCFG1_FLASH_ERA_PW_ERASE_PW_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_VHV
//
//*****************************************************************************
// Field: [27:24] TRIM13_P
//
// Value will be written to FLASH:FVHVCT2.TRIM13_P by the flash device driver
// when an erase/program operation is initiated.
#define FCFG1_FLASH_VHV_TRIM13_P_M                                  0x0F000000
#define FCFG1_FLASH_VHV_TRIM13_P_S                                          24

// Field: [19:16] VHV_P
//
// Value will be written to FLASH:FVHVCT2.VHVCT_P by the flash device driver
// when an erase/program operation is initiated.
#define FCFG1_FLASH_VHV_VHV_P_M                                     0x000F0000
#define FCFG1_FLASH_VHV_VHV_P_S                                             16

// Field:  [11:8] TRIM13_E
//
// Value will be written to FLASH:FVHVCT1.TRIM13_E by the flash device driver
// when an erase/program operation is initiated.
#define FCFG1_FLASH_VHV_TRIM13_E_M                                  0x00000F00
#define FCFG1_FLASH_VHV_TRIM13_E_S                                           8

// Field:   [3:0] VHV_E
//
// Value will be written to FLASH:FVHVCT1.VHVCT_E by the flash device driver
// when an erase/program operation is initiated
#define FCFG1_FLASH_VHV_VHV_E_M                                     0x0000000F
#define FCFG1_FLASH_VHV_VHV_E_S                                              0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_VHV_PV
//
//*****************************************************************************
// Field: [27:24] TRIM13_PV
//
// Value will be written to FLASH:FVHVCT1.TRIM13_PV by the flash device driver
// when an erase/program operation is initiated.
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_M                              0x0F000000
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_S                                      24

