arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_fcfg1.h
// Field:   [7:0] WAIT_SYSCODE
//
// Value will be written to FLASH:WAIT_SYSCODE.WAIT_SYSCODE by boot FW code
// while in safezone.
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_M                        0x000000FF
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_ANA2_TRIM
//
//*****************************************************************************
// Field:    [31] RCOSCHFCTRIMFRACT_EN
//
// Value will be written to  DDI_0_OSC:CTL1.RCOSCHFCTRIMFRACT_EN by boot FW
// while in safezone.
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN                        0x80000000
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN_BITN                           31
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN_M                      0x80000000
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN_S                              31

// Field: [30:26] RCOSCHFCTRIMFRACT
//
// Value will be written to DDI_0_OSC:CTL1.RCOSCHFCTRIMFRACT by boot FW while
// in safezone.
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_M                         0x7C000000
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_S                                 26

// Field: [24:23] SET_RCOSC_HF_FINE_RESISTOR
//
// Value will be written to DDI_0_OSC:ATESTCTL.SET_RCOSC_HF_FINE_RESISTOR by
// boot FW while in safezone.
#define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_M                0x01800000
#define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_S                        23

// Field:    [22] ATESTLF_UDIGLDO_IBIAS_TRIM
//
// Value will be written DDI_0_OSC:ATESTCTL.ATESTLF_UDIGLDO_IBIAS_TRIM by boot
// FW while in safezone.
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM                  0x00400000
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM_BITN                     22
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM_M                0x00400000
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM_S                        22

// Field: [21:16] NANOAMP_RES_TRIM
//
// Value will be written to DDI_0_OSC:ADCDOUBLERNANOAMPCTL.NANOAMP_RES_TRIM by
// boot FW while in safezone.
#define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_M                          0x003F0000
#define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_S                                  16

// Field:    [11] DITHER_EN
//
// Value will be written to ADI_3_REFSYS:DCDCCTL5.DITHER_EN by boot FW while in
// safezone.
#define FCFG1_ANA2_TRIM_DITHER_EN                                   0x00000800
#define FCFG1_ANA2_TRIM_DITHER_EN_BITN                                      11
#define FCFG1_ANA2_TRIM_DITHER_EN_M                                 0x00000800
#define FCFG1_ANA2_TRIM_DITHER_EN_S                                         11

// Field:  [10:8] DCDC_IPEAK
//
// Value will be written to ADI_3_REFSYS:DCDCCTL5.IPEAK by boot FW while in
// safezone.
#define FCFG1_ANA2_TRIM_DCDC_IPEAK_M                                0x00000700
#define FCFG1_ANA2_TRIM_DCDC_IPEAK_S                                         8

// Field:   [7:6] DEAD_TIME_TRIM
//
// Value will be written to ADI_3_REFSYS:DCDCCTL4.DEADTIME_TRIM by boot FW
// while in safezone.
#define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_M                            0x000000C0
#define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_S                                     6

// Field:   [5:3] DCDC_LOW_EN_SEL
//
// Value will be written to  ADI_3_REFSYS:DCDCCTL4.LOW_EN_SEL by boot FW while
// in safezone.
#define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_M                           0x00000038
#define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_S                                    3

// Field:   [2:0] DCDC_HIGH_EN_SEL
//
// Value will be written to  ADI_3_REFSYS:DCDCCTL4.HIGH_EN_SEL by boot FW while
// in safezone.
#define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_M                          0x00000007
#define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_LDO_TRIM
//
//*****************************************************************************
// Field: [28:24] VDDR_TRIM_SLEEP
//
// Value will be written to ADI_3_REFSYS:DCDCCTL1.VDDR_TRIM_SLEEP by boot FW
// while in safezone.
#define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_M                            0x1F000000
#define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_S                                    24

// Field: [18:16] GLDO_CURSRC
//
// Value will be written to ADI_3_REFSYS:DCDCCTL0.GLDO_ISRC by boot FW while in
// safezone.
#define FCFG1_LDO_TRIM_GLDO_CURSRC_M                                0x00070000
#define FCFG1_LDO_TRIM_GLDO_CURSRC_S                                        16

// Field: [12:11] ITRIM_DIGLDO_LOAD
//
// Value will be written to ADI_2_REFSYS:SOCLDOCTL3.ITRIM_DIGLDO_LOAD by boot
// FW while in safezone.
#define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_M                          0x00001800
#define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_S                                  11

// Field:  [10:8] ITRIM_UDIGLDO
//
// Value will be written to ADI_2_REFSYS:SOCLDOCTL3.ITRIM_UDIGLDO by boot FW
// while in safezone.
#define FCFG1_LDO_TRIM_ITRIM_UDIGLDO_M                              0x00000700
#define FCFG1_LDO_TRIM_ITRIM_UDIGLDO_S                                       8

// Field:   [2:0] VTRIM_DELTA
//
// Value will be written to ADI_2_REFSYS:SOCLDOCTL2.VTRIM_DELTA by boot FW
// while in safezone.
#define FCFG1_LDO_TRIM_VTRIM_DELTA_M                                0x00000007
#define FCFG1_LDO_TRIM_VTRIM_DELTA_S                                         0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_BLE_0
//
//*****************************************************************************
// Field:  [31:0] ADDR_0_31
//
// The first 32-bits of the 64-bit MAC BLE address
#define FCFG1_MAC_BLE_0_ADDR_0_31_M                                 0xFFFFFFFF
#define FCFG1_MAC_BLE_0_ADDR_0_31_S                                          0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_BLE_1
//
//*****************************************************************************
// Field:  [31:0] ADDR_32_63
//
// The last 32-bits of the 64-bit MAC BLE address
#define FCFG1_MAC_BLE_1_ADDR_32_63_M                                0xFFFFFFFF
#define FCFG1_MAC_BLE_1_ADDR_32_63_S                                         0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_15_4_0
//
//*****************************************************************************
// Field:  [31:0] ADDR_0_31
//
// The first 32-bits of the 64-bit MAC 15.4 address
#define FCFG1_MAC_15_4_0_ADDR_0_31_M                                0xFFFFFFFF
#define FCFG1_MAC_15_4_0_ADDR_0_31_S                                         0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_15_4_1
//
//*****************************************************************************
// Field:  [31:0] ADDR_32_63
//
// The last 32-bits of the 64-bit MAC 15.4 address
#define FCFG1_MAC_15_4_1_ADDR_32_63_M                               0xFFFFFFFF
#define FCFG1_MAC_15_4_1_ADDR_32_63_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_OTP_DATA4
//
//*****************************************************************************
// Field:    [31] STANDBY_MODE_SEL_INT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.STANDBY_MODE_SEL by flash device driver FW when a flash write
// operation is initiated.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT              0x80000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_BITN                 31
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_M            0x80000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_S                    31

// Field: [30:29] STANDBY_PW_SEL_INT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.STANDBY_PW_SEL by flash device driver FW when a flash write
// operation is initiated.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_M              0x60000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_S                      29

