arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_fcfg1.h
// Field:     [7] STANDBY_MODE_SEL_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.STANDBY_MODE_SEL both by boot FW while in safezone, and by flash
// device driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD               0x00000080
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD_BITN                   7
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD_M             0x00000080
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD_S                      7

// Field:   [6:5] STANDBY_PW_SEL_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.STANDBY_PW_SEL both by boot FW while in safezone, and by flash
// device driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_M               0x00000060
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_S                        5

// Field:     [4] DIS_STANDBY_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.DIS_STANDBY both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD                    0x00000010
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD_BITN                        4
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD_M                  0x00000010
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD_S                           4

// Field:     [3] DIS_IDLE_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.DIS_IDLE both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD                       0x00000008
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD_BITN                           3
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD_M                     0x00000008
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD_S                              3

// Field:   [2:0] VIN_AT_X_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:FSEQPMP.VIN_AT_X both by boot FW while in safezone, and by flash
// device driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_RD_M                     0x00000007
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_RD_S                              0

//*****************************************************************************
//
// Register: FCFG1_O_MISC_TRIM
//
//*****************************************************************************
// Field:   [7:0] TEMPVSLOPE
//
// Signed byte value representing the TEMP slope with battery voltage, in
// degrees C / V, with four fractional bits.
#define FCFG1_MISC_TRIM_TEMPVSLOPE_M                                0x000000FF
#define FCFG1_MISC_TRIM_TEMPVSLOPE_S                                         0

//*****************************************************************************
//
// Register: FCFG1_O_RCOSC_HF_TEMPCOMP
//
//*****************************************************************************
// Field: [31:24] FINE_RESISTOR
//
// Change in FINE_RESISTOR trim
#define FCFG1_RCOSC_HF_TEMPCOMP_FINE_RESISTOR_M                     0xFF000000
#define FCFG1_RCOSC_HF_TEMPCOMP_FINE_RESISTOR_S                             24

// Field: [23:16] CTRIM
//
// Change in CTRIM trim
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIM_M                             0x00FF0000
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIM_S                                     16

// Field:  [15:8] CTRIMFRACT_QUAD
//
// Temp compensation quadratic CTRIMFRACT
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_M                   0x0000FF00
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_S                            8

// Field:   [7:0] CTRIMFRACT_SLOPE
//
// Number of CTRIMFRACT codes per 20 degrees C from default temperature
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_M                  0x000000FF
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_S                           0

//*****************************************************************************
//
// Register: FCFG1_O_TRIM_CAL_REVISION
//
//*****************************************************************************
// Field: [31:16] FT1
//
// The revision of the ATE Trim&#38;Calc document used in FT1 in production
#define FCFG1_TRIM_CAL_REVISION_FT1_M                               0xFFFF0000
#define FCFG1_TRIM_CAL_REVISION_FT1_S                                       16

// Field:  [15:0] MP1
//
// The revision of the ATE Trim&#38;Calc document used in MP1 in production
#define FCFG1_TRIM_CAL_REVISION_MP1_M                               0x0000FFFF
#define FCFG1_TRIM_CAL_REVISION_MP1_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_ICEPICK_DEVICE_ID
//
//*****************************************************************************
// Field: [31:28] PG_REV
//
// Field used to distinguish between different silicon revisions of the device.
#define FCFG1_ICEPICK_DEVICE_ID_PG_REV_M                            0xF0000000
#define FCFG1_ICEPICK_DEVICE_ID_PG_REV_S                                    28

// Field: [27:12] WAFER_ID
//
// Field used to identify silicon die.
#define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_M                          0x0FFFF000
#define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_S                                  12

// Field:  [11:0] MANUFACTURER_ID
//
// Manufacturer code.
//
// 0x02F: Texas Instruments
#define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_M                   0x00000FFF
#define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_S                            0

//*****************************************************************************
//
// Register: FCFG1_O_FCFG1_REVISION
//
//*****************************************************************************
// Field:  [31:0] REV
//
// The revision number of the FCFG1 layout. This value will be read by
// application SW in order to determine which FCFG1 parameters that have valid
// values. This revision number must be incremented by 1 before any devices are
// to be produced if the FCFG1 layout has changed since the previous production
// of devices.
// Value migth change without warning.
#define FCFG1_FCFG1_REVISION_REV_M                                  0xFFFFFFFF
#define FCFG1_FCFG1_REVISION_REV_S                                           0

//*****************************************************************************
//
// Register: FCFG1_O_MISC_OTP_DATA
//
//*****************************************************************************
// Field: [31:28] RCOSC_HF_ITUNE
//
// Trim value that migth become into use for cc26xx PG2.2 and cc13xx PG2.0.
// Trim value for DDI_0_OSC:RCOSCHFCTL.RCOSCHF_ITUNE_TRIM.
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_M                        0xF0000000
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_S                                28

