arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_fcfg1.h
// Field: [15:10] ADC_COMP_AMPTH_LPM
//
// When ADC is forced in comparator mode, this value is used as OPAMP&#39;s
// threshold during LPM_UPDATE mode. Actual amplitude is compared against this
// threshhold to generate 1-bit adc_threshholdmet indicator output.
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_M                      0x0000FC00
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_S                              10

// Field:   [7:2] ADC_COMP_AMPTH_HPM
//
// When ADC is forced in comparator mode, this value is used as OPAMP&#39;s
// threshold during HPM_UPDATE mode. Actual amplitude is compared against this
// threshhold to generate 1-bit adc_threshholdmet indicator output.
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_M                      0x000000FC
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_S                               2

//*****************************************************************************
//
// Register: FCFG1_O_AMPCOMP_CTRL1
//
//*****************************************************************************
// Field:    [30] AMPCOMP_REQ_MODE
//
// Trim value for DDI_0_OSC:AMPCOMPCTL.AMPCOMP_REQ_MODE.
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE                        0x40000000
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_BITN                           30
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_M                      0x40000000
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_S                              30

// Field: [23:20] IBIAS_OFFSET
//
// Offset values of XOSC IBIAS trim. IBIAS trim value would always be greater
// than or equal to this offset in both HPM and LPM.
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_M                          0x00F00000
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_S                                  20

// Field: [19:16] IBIAS_INIT
//
// Initial value of XOSC IBIAS trim. During ramping up, IBIAS is set to
// IBIAS_OFFSET + IBIAS_INIT.
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_M                            0x000F0000
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_S                                    16

// Field:  [15:8] LPM_IBIAS_WAIT_CNT_FINAL
//
// FSM waits for ddi_lpm_ibias_wait_cnt_final clock cycles in
// IDAC_DECREMENT_WITH_MEASURE states in order to compensate slow response of
// the xtal. 8-bits.
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_M              0x0000FF00
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_S                       8

// Field:   [7:4] CAP_STEP
//
// Step size of XOSC CAP trim (both Q1 and Q2) during XOSC mode transition. Can
// vary from 6 to 12. Other values are possible but not valid.
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_M                              0x000000F0
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_S                                       4

// Field:   [3:0] IBIASCAP_HPTOLP_OL_CNT
//
// During HPM to LPM transition, CAP trim and IBIAS trim should be modified by
// this amount. IBIAS and CAP trim open loop count. CAP_REM is remainder of the
// CAP that is left to reach the final cap value. Do not need to program this.
// CAP_TRIM = CAP_INIT - CAP_STEP*IBIASCAP_HPTOLP_OL_CNT - CAP_REM;
// IBIAS_TRIM = IBIAS_INIT - 1*IBIASCAP_HPTOLP_OL_CNT;
// Here, cap_init is decimal conversion of cap_init_col and cap_init_row.
#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_M                0x0000000F
#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_S                         0

//*****************************************************************************
//
// Register: FCFG1_O_ANABYPASS_VALUE2
//
//*****************************************************************************
// Field:  [13:0] XOSC_HF_IBIASTHERM
//
// Value of xosc_hf_ibiastherm when oscdig is bypassed.
#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_M                 0x00003FFF
#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_S                          0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC
//
//*****************************************************************************
// Field:    [17] RSSITRIMCOMPLETE_N
//
// Status of RSSI trim
// 0: Trimmed
// 1: Not trimmed
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N                    0x00020000
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N_BITN                       17
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N_M                  0x00020000
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N_S                          17

// Field:  [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_M                         0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_S                                  9

// Field:   [8:6] QUANTCTLTHRES
//
// Trim value for ADI_0_RF:IFADCQUANT0.TH.
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_M                       0x000001C0
#define FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_S                                6

// Field:   [5:0] DACTRIM
//
// Trim value for ADI_0_RF:IFADCDAC.TRIM.
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_MISC_ADC_DACTRIM_M                             0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DACTRIM_S                                      0

//*****************************************************************************
//
// Register: FCFG1_O_VOLT_TRIM
//
//*****************************************************************************
// Field: [28:24] VDDR_TRIM_HH
//
// Trim value for 1.94V VDDR found in production test (for CC13xx high PA
// output power only).
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_M                              0x1F000000
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_S                                      24

// Field: [20:16] VDDR_TRIM_H
//
// Trim value for 1.85V VDDR found in production test (for external VDDR load
// mode)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_M                               0x001F0000
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_S                                       16

// Field:  [12:8] VDDR_TRIM_SLEEP_H
//
// Trim value for 1.75V VDDR recharge target found in production test (for
// external VDDR load mode).
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_M                         0x00001F00
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_S                                  8

// Field:   [4:0] TRIMBOD_H
//
// Trim value for 2.0V VDDS BOD target found in production test.
#define FCFG1_VOLT_TRIM_TRIMBOD_H_M                                 0x0000001F
#define FCFG1_VOLT_TRIM_TRIMBOD_H_S                                          0

//*****************************************************************************
//
// Register: FCFG1_O_OSC_CONF
//
//*****************************************************************************
// Field:    [29] ADC_SH_VBUF_EN
//
// Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_VBUF_EN.
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN                               0x20000000
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN_BITN                                  29
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN_M                             0x20000000
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN_S                                     29

// Field:    [28] ADC_SH_MODE_EN
//
// Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_MODE_EN.
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN                               0x10000000
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN_BITN                                  28
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN_M                             0x10000000
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN_S                                     28

